package test;

import bayes.BayesBrain;
import bayes.BayesClassifier;

public class Test2 {
    private static void test2() {
        BayesBrain bayesBrain = new BayesBrain();
        final String[] testText1 = ("***********#1饿了么***********\n" +
                "\n" +
                "尝想来桂林米粉(武胜路店)\n" +
                "\n" +
                "--已在线支付--\n" +
                "\n" +
                "--------------------------------\n" +
                "下单时间：06-1000:06\n" +
                "------------1号篮子-------------\n" +
                "原味螺蛳粉-中辣×134.88\n" +
                "鸡蛋炒面×133.88\n" +
                "绿豆沙×110\n" +
                "加酸辣酸尖×19\n" +
                "加卤蛋×13\n" +
                "------------其它费用------------\n" +
                "餐盒×14\n" +
                "--------------------------------\n" +
                "店铺满减优惠×1-25\n" +
                "超级会员专享红包×1-6\n" +
                "配送费3\n" +
                "--------------------------------\n" +
                "已付66.76\n" +
                "--------------------------------\n" +
                "通纯招待所东台路290号（弄堂进来左手第一家）\n" +
                "姜**\n" +
                "[超级会员]\n" +
                "139****6365\n" +
                "17091950953转686\n" +
                "若号码中有【逗号】或【转】，则需要先拨通11位主机号，再手动输入逗号或转之后的分机\n" +
                "号，3小时内有效，若无法拨通，请将订单号短信发至“10690510777”，系统将派发有效手机\n" +
                "号。\n" +
                "\n" +
                "************#1完************").split("\\s+");

        final String[] testText2 = ("**#5美团外卖**\n" +
                "*溜香煎饼*\n" +
                "\n" +
                "下单时间：06-0917:34\n" +
                "********************************\n" +
                "------------1号口袋------------溜香辣酸粉\n" +
                "[8.0折,原价15.0]*112.0溜香煎饼(不加香菜多辣)*19.0--------------其它-------------\n" +
                "-\n" +
                "餐盒费3配送费3.0[减配送费1.0元]-￥1.0********************************\n" +
                "原价：30.0元\n" +
                "(用户在线支付)26.0元\n" +
                "--------------------------------\n" +
                "为保护隐私，顾客地址已隐藏。您可登录美团商家端或骑手端查看。\n" +
                "顾客号码:1******5551\n" +
                "虚拟号码:13240472984转4348\n" +
                "备用号码1:18515210943转7896\n" +
                "【若无法拨通，请通过美团外卖商家端查询最新号码】\n" +
                "请先生\n" +
                "\n" +
                "BarCode:{BM35tzr0TVC2").split("\\s+");


        BayesClassifier bayesClassifier = new BayesClassifier(
                bayesBrain
                        .learn("外卖", testText1)
                        .learn("外卖", testText2)
        );

        bayesBrain.show();

        final String[] text3 = ("**********#27饿了么**********\n" +
                "\n" +
                "酱汁满串烧烤集市（隆昌路店）\n" +
                "\n" +
                "--已在线支付--\n" +
                "\n" +
                "--------------------------------\n" +
                "下单时间：06-0703:00\n" +
                "备注：可乐给一个冰的谢谢老板\n" +
                "------------1号篮子-------------\n" +
                "不辣！不辣！不辣！×10.10\n" +
                "烤土豆片【×2】5\n" +
                "烤豆角.【×3】7.50\n" +
                "鸡里脊肉×16\n" +
                "金针菇【×2】5\n" +
                "烤娃娃菜【×2】5\n" +
                "牛肉小串（20串）【×2】45.60\n" +
                "鸡心×16\n" +
                "鸡皮【×2】12\n" +
                "芝香肉串×14.50\n" +
                "五花鸭肉【×2】8\n" +
                "烤现椒×13\n" +
                "烤蒜苗【×2】5\n" +
                "可口可乐×15\n" +
                "------------其它费用------------\n" +
                "餐盒×16.30\n" +
                "--------------------------------\n" +
                "店铺满减优惠×1-45\n" +
                "超值换购×1-2.50\n" +
                "超级会员专享红包×1-4\n" +
                "配送费2\n" +
                "--------------------------------\n" +
                "已付74.50\n" +
                "--------------------------------\n" +
                "锦江之星旅馆(上海杨浦大桥店)路口那个锦江风尚酒店快客便利店对面765房间\n" +
                "赵**\n" +
                "[超级会员]\n" +
                "159****4706\n" +
                "17091265038转466\n" +
                "若号码中有【逗号】或【转】，则需要先拨通11位主机号，再手动输入逗号或转之后的分机\n" +
                "号，3小时内有效，若无法拨通，请将订单号短信发至“10690510777”，系统将派发有效手机\n" +
                "号。\n" +
                "订单号:3043448183639074938\n" +
                "\n" +
                "***********#27完***********\n").split("\\s+");


        System.out.println(bayesClassifier.probabilityOf(text3));
    }

    public static void main(String[] args) {
        test2();

    }
}
